In [1]:
import pandas as pd

In [2]:
data = '../raw/BL2013_MF2599_v2.2.csv'
df = pd.read_csv(data)

In [3]:
df.head()

,BLcode,country,year,sex,agefrom,ageto,lu,lp,lpc,ls,lsc,lh,lhc,yr_sch,yr_sch_pri,yr_sch_sec,yr_sch_ter,pop,WBcode,region_code
0,1,Algeria,1950,MF,25,999,79.20,18.88,3.55,1.58,0.51,0.34,0.23,0.90,0.79,0.10,0.01,3609,DZA,Middle East and North Africa
1,1,Algeria,1955,MF,25,999,79.80,18.10,3.60,1.70,0.50,0.40,0.27,0.90,0.78,0.11,0.01,3882,DZA,Middle East and North Africa
2,1,Algeria,1960,MF,25,999,84.56,13.51,2.82,1.60,0.60,0.33,0.21,0.72,0.61,0.10,0.01,4097,DZA,Middle East and North Africa
3,1,Algeria,1965,MF,25,999,88.00,9.80,2.43,1.70,0.80,0.40,0.26,0.64,0.51,0.12,0.01,4215,DZA,Middle East and North Africa
4,1,Algeria,1970,MF,25,999,84.40,13.00,3.17,2.20,1.02,0.30,0.19,0.78,0.64,0.14,0.01,4684,DZA,Middle East and North Africa

In [4]:
df.columns

Index(['BLcode', 'country', 'year', 'sex', 'agefrom', 'ageto', 'lu', 'lp',
       'lpc', 'ls', 'lsc', 'lh', 'lhc', 'yr_sch', 'yr_sch_pri', 'yr_sch_sec',
       'yr_sch_ter', 'pop', 'WBcode', 'region_code'],
      dtype='object')

In [5]:
cols = ['year', 'country', 'lu', 'WBcode']
df = df[cols].reset_index(drop=True)

In [6]:
rename_dic = {'country': 'name',
              'lu': 'no_education',
              'WBcode': 'id'}

In [7]:
df = df.rename(columns=rename_dic)

In [8]:
df = df.sort_values(['year', 'name']).reset_index(drop=True)

In [9]:
df.head()

   year         name  no_education   id
0  1950  Afghanistan         97.79  AFG
1  1950      Albania         44.49  ALB
2  1950      Algeria         79.20  DZA
3  1950    Argentina         15.87  ARG
4  1950      Armenia          7.85  ARM

In [10]:
export = '../clean/no_education_by_country.csv'
df.to_csv(export, index=False)